In [57]:
import numpy as np
import pandas as pd

In [58]:
df_fix = pd.read_csv("./fixes_file.txt",delimiter="\t")

In [59]:
df_fix.head()

,Name,Latitude,Latitude2,Latitude3,Unnamed: 4,Unnamed: 5,Longitude,Longitude2,Longitude3,Unnamed: 9
0,AG,N31,59,6,E118,47,42,NaN,NaN,NaN
1,AGAVO,N37,10,0,E124,0,0,NaN,NaN,NaN
2,AGOBA,N01,58,42,E108,30,0,NaN,NaN,NaN
3,AGPOR,N20,18,24,E110,13,54,NaN,NaN,NaN
4,AGSON,N02,15,0,E114,51,24,NaN,NaN,NaN

In [60]:
df_fix.columns = [u'Name', u'Latitude', u'Latitude2', u'Latitude3', u'Longitude1',
       u'Longitude2', u'Longitude3', u'1', u'2',
       u'3']

In [61]:
df_fix.head()

,Name,Latitude,Latitude2,Latitude3,Longitude1,Longitude2,Longitude3,1,2,3
0,AG,N31,59,6,E118,47,42,NaN,NaN,NaN
1,AGAVO,N37,10,0,E124,0,0,NaN,NaN,NaN
2,AGOBA,N01,58,42,E108,30,0,NaN,NaN,NaN
3,AGPOR,N20,18,24,E110,13,54,NaN,NaN,NaN
4,AGSON,N02,15,0,E114,51,24,NaN,NaN,NaN

In [62]:
def latCal(l1,l2,l3):
    res = float(l1[1:])
    if(l1[0] == 'S'):
        res = -1 * res
    res = res + 1/60.0 * float(l2)
    res = res + 1/3600.0 * float(l3)
    return res

In [63]:
def lonCal(l1,l2,l3):
    res = float(l1[1:])
    if(l1[0] == 'W'):
        res = -1 * res
    res = res + 1/60.0 * float(l2)
    res = res + 1/3600.0 * float(l3)
    return res

In [64]:
df_fix.shape

(1149, 10)

In [65]:
df_fix[982:983]

,Name,Latitude,Latitude2,Latitude3,Longitude1,Longitude2,Longitude3,1,2,3
982,TMRPO,N43,2,0,E113,12,0,NaN,NaN,NaN

In [66]:
df_fix[822:823]

,Name,Latitude,Latitude2,Latitude3,Longitude1,Longitude2,Longitude3,1,2,3
822,POMOK,N31,27,0,E121,7,0,NaN,NaN,NaN

In [67]:
df_fix['Lat'] = df_fix.apply(lambda x: latCal(x.Latitude, x.Latitude2,x.Latitude3),axis=1)

In [68]:
df_fix['Lon'] = df_fix.apply(lambda x: lonCal(x.Longitude1, x.Longitude2,x.Longitude3),axis=1)

In [69]:
df_fix.head()

,Name,Latitude,Latitude2,Latitude3,Longitude1,Longitude2,Longitude3,1,2,3,Lat,Lon
0,AG,N31,59,6,E118,47,42,NaN,NaN,NaN,31.985000,118.795000
1,AGAVO,N37,10,0,E124,0,0,NaN,NaN,NaN,37.166667,124.000000
2,AGOBA,N01,58,42,E108,30,0,NaN,NaN,NaN,1.978333,108.500000
3,AGPOR,N20,18,24,E110,13,54,NaN,NaN,NaN,20.306667,110.231667
4,AGSON,N02,15,0,E114,51,24,NaN,NaN,NaN,2.250000,114.856667

In [ ]:
df_fix.drop([])